Res-firecracker-random-in2-v8/firecracker_t_4_c_6_frontVcpu_1_wrkVcpu_1/wrk.txt
Running 1m test @ http://frontend:5000
  4 threads and 6 connections
  Thread calibration: mean lat.: 5084.767ms, rate sampling interval: 17989ms
  Thread calibration: mean lat.: 5134.885ms, rate sampling interval: 18087ms
  Thread calibration: mean lat.: 1196.410ms, rate sampling interval: 3547ms
  Thread calibration: mean lat.: 5113.313ms, rate sampling interval: 17989ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    33.43s    13.40s    0.93m    56.74%
    Req/Sec   269.05      5.16   284.00     80.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   34.57s 
 75.000%   46.17s 
 90.000%   49.51s 
 99.000%    0.93m 
 99.900%    0.96m 
 99.990%    0.96m 
 99.999%    0.96m 
100.000%    0.96m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.295     0.000000            1         1.00
   14942.207     0.100000         5401         1.11
   19890.175     0.200000        10785         1.25
   24870.911     0.300000        16180         1.43
   29802.495     0.400000        21569         1.67
   34570.239     0.500000        26967         2.00
   36798.463     0.550000        29684         2.22
   38961.151     0.600000        32355         2.50
   41418.751     0.650000        35070         2.86
   43876.351     0.700000        37752         3.33
   46170.111     0.750000        40456         4.00
   47022.079     0.775000        41865         4.44
   47546.367     0.800000        43220         5.00
   47972.351     0.825000        44517         5.71
   48431.103     0.850000        45903         6.67
   48857.087     0.875000        47186         8.00
   49184.767     0.887500        47924         8.89
   49512.447     0.900000        48559        10.00
   49938.431     0.912500        49227        11.43
   50462.719     0.925000        49894        13.33
   50921.471     0.937500        50619        16.00
   51118.079     0.943750        50911        17.78
   51314.687     0.950000        51232        20.00
   51544.063     0.956250        51621        22.86
   51773.439     0.962500        51915        26.67
   52199.423     0.968750        52245        32.00
   52494.335     0.971875        52411        35.56
   53051.391     0.975000        52574        40.00
   53608.447     0.978125        52743        45.71
   54198.271     0.981250        52916        53.33
   54820.863     0.984375        53087        64.00
   55083.007     0.985938        53165        71.11
   55443.455     0.987500        53252        80.00
   55738.367     0.989062        53334        91.43
   56066.047     0.990625        53422       106.67
   56393.727     0.992188        53504       128.00
   56557.567     0.992969        53543       142.22
   56721.407     0.993750        53591       160.00
   56786.943     0.994531        53636       182.86
   56885.247     0.995313        53673       213.33
   57049.087     0.996094        53721       256.00
   57114.623     0.996484        53742       284.44
   57180.159     0.996875        53757       320.00
   57278.463     0.997266        53785       365.71
   57343.999     0.997656        53802       426.67
   57442.303     0.998047        53824       512.00
   57475.071     0.998242        53832       568.89
   57507.839     0.998437        53843       640.00
   57540.607     0.998633        53854       731.43
   57573.375     0.998828        53865       853.33
   57606.143     0.999023        53873      1024.00
   57638.911     0.999121        53883      1137.78
   57638.911     0.999219        53883      1280.00
   57671.679     0.999316        53892      1462.86
   57671.679     0.999414        53892      1706.67
   57704.447     0.999512        53900      2048.00
   57704.447     0.999561        53900      2275.56
   57737.215     0.999609        53911      2560.00
   57737.215     0.999658        53911      2925.71
   57737.215     0.999707        53911      3413.33
   57737.215     0.999756        53911      4096.00
   57737.215     0.999780        53911      4551.11
   57769.983     0.999805        53920      5120.00
   57769.983     0.999829        53920      5851.43
   57769.983     0.999854        53920      6826.67
   57769.983     0.999878        53920      8192.00
   57769.983     0.999890        53920      9102.22
   57769.983     0.999902        53920     10240.00
   57769.983     0.999915        53920     11702.86
   57769.983     0.999927        53920     13653.33
   57769.983     0.999939        53920     16384.00
   57769.983     0.999945        53920     18204.44
   57769.983     0.999951        53920     20480.00
   57769.983     0.999957        53920     23405.71
   57802.751     0.999963        53922     27306.67
   57802.751     1.000000        53922          inf
#[Mean    =    33426.377, StdDeviation   =    13404.473]
#[Max     =    57769.984, Total count    =        53922]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  64204 requests in 1.00m, 26.55MB read
Requests/sec:   1070.08
Transfer/sec:    453.19KB